Revit 2024 API
PipeFittingAndAccessoryPressureDropData.CalculationType Property
 The calculation type, a bitmask of FittingAndAccessoryCalculationType.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public int CalculationType { get; }
Visual Basic
Public ReadOnly Property CalculationType As Integer
	Get
Visual C++
public:
property int CalculationType {
	int get ();
}
See Also
PipeFittingAndAccessoryPressureDropData Class
Autodesk.Revit.DB.Plumbing Namespace